//          3. Мінімум функції
//
//  Реалізувати програму, що дозволяє знайти мінімум деякої функції на визначеному інтервалі.
// Алгоритм знаходження мінімуму полягає в послідовному переборі з певним кроком точок інтервалу
// і порівнянні значень функції в поточній точці з раніше знайденим мінімумом.
//
//  Реалізація:
// 2. Опис інтерфейсу, створення класу, який використовує інтерфейс як тип параметру функції знаходження мінімуму,
// створення окремих класів, які реалізують інтерфейс
//
//  Перевірити роботу програми на двох різних функціях.

package task3.v2;

public class Main {
    public static void main(String[] args) {
        FunctionMinFinder.test(new SpecificFunction1());
        FunctionMinFinder.test(new SpecificFunction2());
    }
}