//          3. Мінімум функції
//
//  Реалізувати програму, що дозволяє знайти мінімум деякої функції на визначеному інтервалі.
// Алгоритм знаходження мінімуму полягає в послідовному переборі з певним кроком точок інтервалу
// і порівнянні значень функції в поточній точці з раніше знайденим мінімумом.
//
//  Реалізація:
// 1. Використання абстрактного та похідних класів
//
//  Перевірити роботу програми на двох різних функціях.

package task3.v1;

public class Main {
    public static void main(String[] args) {
        new SpecificFunction1().test();
        new SpecificFunction2().test();
    }
}